# Taps
tap "domt4/autoupdate"
tap "nikitabobko/tap"

# Binaries
brew "atuin"
brew "bat"
brew "delve"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "gopls"
brew "helix"
brew "helm-ls"
brew "jj"
brew "lazygit"
brew "FelixKratz/formulae/borders"
brew "jjui"
brew "markdown-oxide"
brew "glow"
brew "gemini-cli"
brew "mise"
brew "mas" # Mac App Store manager
brew "neovim"
brew "pinentry-mac"
brew "prettier"
brew "ripgrep"
brew "starship"
brew "stow"
brew "superhtml"
brew "taplo"
brew "templ"
brew "thefuck"
brew "tlrc"
brew "tree"
brew "uutils-coreutils"
brew "uutils-diffutils"
brew "uutils-findutils"
brew "typescript-language-server"
brew "vscode-langservers-extracted"
brew "watson"
brew "yaml-language-server"
brew "yazi"
brew "zellij"
brew "zoxide"

# Apps
cask "1password"
cask "aerospace"
cask "arc"
cask "chatgpt"
cask "docker-desktop"
cask "font-monaspace"
cask "ghostty"
cask "jetbrains-toolbox"
cask "linear-linear"
cask "raycast"
cask "scroll-reverser"
cask "spotify"
cask "whatsapp"
cask "zed"
cask "zen"
