# Taps
tap "domt4/autoupdate"
tap "nikitabobko/tap"

# Binaries
brew "atuin"
brew "bat"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "helix"
brew "jj"
brew "lazygit"
brew "lazyjj"
brew "markdown-oxide"
brew "mdless"
brew "mise"
brew "mas" # Mac App Store manager
brew "neovim"
brew "pinentry-mac"
brew "prettier"
brew "ripgrep"
brew "starship"
brew "stow"
brew "taplo"
brew "thefuck"
brew "tlrc"
brew "tree"
brew "uutils-coreutils"
brew "uutils-diffutils"
brew "uutils-findutils"
brew "typescript-language-server"
brew "vscode-langservers-extracted"
brew "yaml-language-server"
brew "zellij"
brew "zoxide"

# Apps
cask "1password"
cask "aerospace"
cask "arc"
cask "chatgpt"
cask "docker"
cask "ghostty"
cask "jetbrains-toolbox"
cask "raycast"
cask "scroll-reverser"
cask "spotify"
cask "whatsapp"
