tap "domt4/autoupdate"
tap "nikitabobko/tap"
brew "atuin"
brew "fd"
brew "fish"
brew "fzf"
brew "helix"
brew "jj"
brew "lazygit"
brew "lazyjj"
brew "mise"
brew "neovim"
brew "pinentry-mac"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tlrc"
brew "tree"
brew "zellij"
brew "zoxide"
cask "1password"
cask "aerospace"
cask "arc"
cask "chatgpt"
cask "docker"
cask "ghostty"
cask "jetbrains-toolbox"
cask "raycast"
cask "spotify"
cask "whatsapp"
